Revit 2024 API
ParameterTypeId.SteelElemProfileLength Property
 "Length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId SteelElemProfileLength { get; }
Visual Basic
Public Shared ReadOnly Property SteelElemProfileLength As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ SteelElemProfileLength {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace